In [ ]:
#!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\lenovo\appdata\local\programs\python\python310\lib\site-packages (2.9.5)

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd
from sqlalchemy import create_engine, text
import psycopg2
import numpy as np

## Create Database Tables

In [ ]:
conn = psycopg2.connect(
    host="localhost",
    port='5432',
    database="postgres",
    user="postgres",
    password="123")

# Set autocommit to true to create database
conn.autocommit = True

# Create a new database
db_name = "crime_data_5310"
cur = conn.cursor()
cur.execute(f"CREATE DATABASE {db_name}")

print(str(db_name)+' database has been successfully created in PostgreSQL.')

crime_data_5310 database has been successfully created in PostgreSQL.

In [2]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost:5432/crime_data_5310'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

In [ ]:
# Create commands
stmt = (
"""
CREATE TABLE community (
	community_id serial PRIMARY KEY,
	community_name varchar(150) NOT NULL,
	state char(2) NOT NULL,
	community_population int NOT NULL
);

""",
"""
CREATE TABLE value_type (
	value_type_id serial PRIMARY KEY,
	value_type varchar(30) NOT NULL
);

""",
"""

CREATE TABLE race (
	race_id serial PRIMARY KEY,
	race_category varchar(30) NOT NULL,
	value_type_id int,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
""" 
CREATE TABLE community_race (
	community_id serial,
	race_id int,
	race_value float,
	PRIMARY KEY (community_id, race_id),
	FOREIGN KEY (race_id) REFERENCES race,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE age (
	age_id serial PRIMARY KEY,
	age_category varchar(30) NOT NULL,
	value_type_id int,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_age (
	community_id serial,
	age_id int,
	age_value float,
	PRIMARY KEY (community_id, age_id),
	FOREIGN KEY (age_id) REFERENCES age,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE income (
	income_id serial PRIMARY KEY,
	income_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_income (
	community_id serial,
	income_id int,
	income_value float,
	PRIMARY KEY (community_id, income_id),
	FOREIGN KEY (income_id) REFERENCES income,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE income_race (
	income_race_id serial PRIMARY KEY,
	inc_race_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_income_race (
	community_id serial,
	income_race_id int,
	income_race_value float,
	PRIMARY KEY (community_id, income_race_id),
	FOREIGN KEY (income_race_id) REFERENCES income_race,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE education (
	education_id serial PRIMARY KEY,
	education_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_education (
	community_id serial,
	education_id int,
	education_value float,
	PRIMARY KEY (community_id, education_id),
	FOREIGN KEY (education_id) REFERENCES education,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE employment (
	employment_id serial PRIMARY KEY,
	employment_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_employment (
	community_id serial,
	employment_id int,
	employment_value float,
	PRIMARY KEY (community_id, employment_id),
	FOREIGN KEY (employment_id) REFERENCES employment,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE family (
	family_id serial PRIMARY KEY,
	family_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_family (
	community_id serial,
	family_id int,
	family_value float,
	PRIMARY KEY (community_id, family_id),
	FOREIGN KEY (family_id) REFERENCES family,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE immigration (
	immigration_id serial PRIMARY KEY,
	immigration_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_immigration (
	community_id serial,
	immigration_id int,
	immigration_value float,
	PRIMARY KEY (community_id, immigration_id),
	FOREIGN KEY (immigration_id) REFERENCES immigration,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE languages (
	language_id serial PRIMARY KEY,
	language_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_languages (
	community_id serial,
	language_id int,
	language_value float,
	PRIMARY KEY (community_id, language_id),
	FOREIGN KEY (language_id) REFERENCES languages,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE community_housing_info (
	community_housing_info_id serial PRIMARY KEY,
	community_housing_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_community_housing_info (
	community_id serial,
	community_housing_info_id int,
	community_housing_info_value float,
	PRIMARY KEY (community_id, community_housing_info_id),
	FOREIGN KEY (community_housing_info_id) REFERENCES community_housing_info,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE housing (
	housing_id serial PRIMARY KEY,
	housing_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_housing(
	community_id serial,
	housing_id int,
	housing_value float,
	PRIMARY KEY (community_id, housing_id),
	FOREIGN KEY (housing_id) REFERENCES housing,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE housing_migration (
	housing_migration_id serial PRIMARY KEY,
	housing_migration_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_housing_migration(
	community_id serial,
	housing_migration_id int,
	housing_migration_value float,
	PRIMARY KEY (community_id, housing_migration_id),
	FOREIGN KEY (housing_migration_id) REFERENCES housing_migration,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE urban (
	urban_id serial PRIMARY KEY,
	urban_category varchar(30) NOT NULL,
	value_type_id int,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_urban (
	community_id serial,
	urban_id int,
	urban_value float,
	PRIMARY KEY (community_id, urban_id),
	FOREIGN KEY (urban_id) REFERENCES urban,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE poverty (
	poverty_id serial PRIMARY KEY,
	poverty_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_poverty (
	community_id serial,
	poverty_id int,
	poverty_value float,
	PRIMARY KEY (community_id, poverty_id),
	FOREIGN KEY (poverty_id) REFERENCES poverty,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE community_statistics (
	community_statistics_id serial PRIMARY KEY,
	community_statistics_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_community_statistics(
	community_id serial,
	community_statistics_id int,
	community_statistics_value float,
	PRIMARY KEY (community_id, community_statistics_id),
	FOREIGN KEY (community_statistics_id) REFERENCES community_statistics,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE homeless (
	homeless_id serial PRIMARY KEY,
	homeless_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_homeless (
	community_id serial,
	homeless_id int,
	homeless_value float,
	PRIMARY KEY (community_id, homeless_id),
	FOREIGN KEY (homeless_id) REFERENCES homeless,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE police_force (
	police_force_id serial PRIMARY KEY,
	police_force_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_police_force (
	community_id serial,
	police_force_id int,
	police_force_value float,
	PRIMARY KEY (community_id, police_force_id),
	FOREIGN KEY (police_force_id) REFERENCES police_force,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE police_requests (
	police_requests_id serial PRIMARY KEY,
	police_requests_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_police_requests (
	community_id serial,
	police_requests_id int,
	police_requests_value float,
	PRIMARY KEY (community_id, police_requests_id),
	FOREIGN KEY (police_requests_id) REFERENCES police_requests,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE police_demographics (
	police_demographics_id serial PRIMARY KEY,
	police_demographics_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_police_demographics (
	community_id serial,
	police_demographics_id int,
	police_demographics_value float,
	PRIMARY KEY (community_id, police_demographics_id),
	FOREIGN KEY (police_demographics_id) REFERENCES police_demographics,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE police_operations (
	police_operations_id serial PRIMARY KEY,
	police_operations_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_police_operations (
	community_id serial,
	police_operations_id int,
	police_operations_value float,
	PRIMARY KEY (community_id, police_operations_id),
	FOREIGN KEY (police_operations_id) REFERENCES police_operations,
    FOREIGN KEY (community_id) REFERENCES community
);

""",
"""
CREATE TABLE crimes (
	crimes_id serial PRIMARY KEY,
	crimes_category varchar(30) NOT NULL,
	value_type_id integer,
	FOREIGN KEY (value_type_id) REFERENCES value_type
);

""",
"""
CREATE TABLE community_crimes(
	community_id serial,
	crimes_id int,
	crimes_value float,
	PRIMARY KEY (community_id, crimes_id),
	FOREIGN KEY (crimes_id) REFERENCES crimes,
    FOREIGN KEY (community_id) REFERENCES community
);

""")

# Create a connection and cursor
with psycopg2.connect(database=db_name, user="postgres", password="123", host="localhost") as conn:
    with conn.cursor() as cur:
        for command in stmt:
            cur.execute(command)
        
        # commit the changes to the database
        conn.commit()
        
print('The tables have been successfully created in PostgreSQL.')

The tables have been successfully created in PostgreSQL.

## Loading Dataset

In [ ]:
df1 = pd.read_csv('crimedata.csv', encoding='latin-1')
df1.head()

,Êcommunityname,state,countyCode,communityCode,fold,population,householdsize,racepctblack,racePctWhite,racePctAsian,...,burglaries,burglPerPop,larcenies,larcPerPop,autoTheft,autoTheftPerPop,arsons,arsonsPerPop,ViolentCrimesPerPop,nonViolPerPop
0,BerkeleyHeightstownship,NJ,39,5320,1,11980,3.10,1.37,91.78,6.50,...,14,114.85,138,1132.08,16,131.26,2,16.41,41.02,1394.59
1,Marpletownship,PA,45,47616,1,23123,2.82,0.80,95.57,3.44,...,57,242.37,376,1598.78,26,110.55,1,4.25,127.56,1955.95
2,Tigardcity,OR,?,?,1,29344,2.43,0.74,94.33,3.43,...,274,758.14,1797,4972.19,136,376.3,22,60.87,218.59,6167.51
3,Gloversvillecity,NY,35,29443,1,16656,2.40,1.70,97.35,0.50,...,225,1301.78,716,4142.56,47,271.93,?,?,306.64,?
4,Bemidjicity,MN,7,5068,1,11245,2.76,0.53,89.16,1.17,...,91,728.93,1060,8490.87,91,728.93,5,40.05,?,9988.79

## Clean Dataset

In [ ]:
df1 = df1.rename(columns = {"Êcommunityname":"communityname"})

In [ ]:
df1.head()

,communityname,state,countyCode,communityCode,fold,population,householdsize,racepctblack,racePctWhite,racePctAsian,...,burglaries,burglPerPop,larcenies,larcPerPop,autoTheft,autoTheftPerPop,arsons,arsonsPerPop,ViolentCrimesPerPop,nonViolPerPop
0,BerkeleyHeightstownship,NJ,39,5320,1,11980,3.10,1.37,91.78,6.50,...,14,114.85,138,1132.08,16,131.26,2,16.41,41.02,1394.59
1,Marpletownship,PA,45,47616,1,23123,2.82,0.80,95.57,3.44,...,57,242.37,376,1598.78,26,110.55,1,4.25,127.56,1955.95
2,Tigardcity,OR,?,?,1,29344,2.43,0.74,94.33,3.43,...,274,758.14,1797,4972.19,136,376.3,22,60.87,218.59,6167.51
3,Gloversvillecity,NY,35,29443,1,16656,2.40,1.70,97.35,0.50,...,225,1301.78,716,4142.56,47,271.93,?,?,306.64,?
4,Bemidjicity,MN,7,5068,1,11245,2.76,0.53,89.16,1.17,...,91,728.93,1060,8490.87,91,728.93,5,40.05,?,9988.79

Convert object type to float and replace ? with -1 as default value for null

In [ ]:
for col in df1.columns:
    if df1[col].dtype == object:
        if '?' in df1[col].unique():
            df1[col] = df1[col].replace('?', -1)
        try:
            df1[col] = df1[col].astype(float)
        except ValueError:
            pass
    elif df1[col].dtype == int:
        df1[col] = df1[col].astype(float)

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2215 entries, 0 to 2214
Columns: 147 entries, communityname to nonViolPerPop
dtypes: float64(145), object(2)
memory usage: 2.5+ MB

In [ ]:
df1.head()

,communityname,state,countyCode,communityCode,fold,population,householdsize,racepctblack,racePctWhite,racePctAsian,...,burglaries,burglPerPop,larcenies,larcPerPop,autoTheft,autoTheftPerPop,arsons,arsonsPerPop,ViolentCrimesPerPop,nonViolPerPop
0,BerkeleyHeightstownship,NJ,39.0,5320.0,1.0,11980.0,3.10,1.37,91.78,6.50,...,14.0,114.85,138.0,1132.08,16.0,131.26,2.0,16.41,41.02,1394.59
1,Marpletownship,PA,45.0,47616.0,1.0,23123.0,2.82,0.80,95.57,3.44,...,57.0,242.37,376.0,1598.78,26.0,110.55,1.0,4.25,127.56,1955.95
2,Tigardcity,OR,-1.0,-1.0,1.0,29344.0,2.43,0.74,94.33,3.43,...,274.0,758.14,1797.0,4972.19,136.0,376.30,22.0,60.87,218.59,6167.51
3,Gloversvillecity,NY,35.0,29443.0,1.0,16656.0,2.40,1.70,97.35,0.50,...,225.0,1301.78,716.0,4142.56,47.0,271.93,-1.0,-1.00,306.64,-1.00
4,Bemidjicity,MN,7.0,5068.0,1.0,11245.0,2.76,0.53,89.16,1.17,...,91.0,728.93,1060.0,8490.87,91.0,728.93,5.0,40.05,-1.00,9988.79

Each row in df1 is a unique community.

Since each row is a unique community, create a community_id column

In [ ]:
df1.insert(0, 'community_id', range(1, 1 + len(df1)))

In [ ]:
df1.head()

,community_id,communityname,state,countyCode,communityCode,fold,population,householdsize,racepctblack,racePctWhite,...,burglaries,burglPerPop,larcenies,larcPerPop,autoTheft,autoTheftPerPop,arsons,arsonsPerPop,ViolentCrimesPerPop,nonViolPerPop
0,1,BerkeleyHeightstownship,NJ,39.0,5320.0,1.0,11980.0,3.10,1.37,91.78,...,14.0,114.85,138.0,1132.08,16.0,131.26,2.0,16.41,41.02,1394.59
1,2,Marpletownship,PA,45.0,47616.0,1.0,23123.0,2.82,0.80,95.57,...,57.0,242.37,376.0,1598.78,26.0,110.55,1.0,4.25,127.56,1955.95
2,3,Tigardcity,OR,-1.0,-1.0,1.0,29344.0,2.43,0.74,94.33,...,274.0,758.14,1797.0,4972.19,136.0,376.30,22.0,60.87,218.59,6167.51
3,4,Gloversvillecity,NY,35.0,29443.0,1.0,16656.0,2.40,1.70,97.35,...,225.0,1301.78,716.0,4142.56,47.0,271.93,-1.0,-1.00,306.64,-1.00
4,5,Bemidjicity,MN,7.0,5068.0,1.0,11245.0,2.76,0.53,89.16,...,91.0,728.93,1060.0,8490.87,91.0,728.93,5.0,40.05,-1.00,9988.79

## ETL

#### Create df_community

Slice necessary columns

In [ ]:
df_community = df1[['community_id','communityname', 'state', 'population']]

In [ ]:
df_community.head()

   community_id            communityname state  population
0             1  BerkeleyHeightstownship    NJ     11980.0
1             2           Marpletownship    PA     23123.0
2             3               Tigardcity    OR     29344.0
3             4         Gloversvillecity    NY     16656.0
4             5              Bemidjicity    MN     11245.0

Rename columns

In [ ]:
df_community = df_community.rename(columns ={"communityname": "community_name",
                                            "population": "community_population"})

In [ ]:
df_community.head()

   community_id           community_name state  community_population
0             1  BerkeleyHeightstownship    NJ               11980.0
1             2           Marpletownship    PA               23123.0
2             3               Tigardcity    OR               29344.0
3             4         Gloversvillecity    NY               16656.0
4             5              Bemidjicity    MN               11245.0

Insert into df_community table in database

In [ ]:
df_community.to_sql(name='community', con=engine, if_exists='append', index=False)

215

#### Create df_value_type

In [ ]:
df_value_type = pd.DataFrame({
  'value_type_id': [1, 2],
  'value_type': ['Percentage', 'Integer']})

In [ ]:
df_value_type.head()

   value_type_id  value_type
0              1  Percentage
1              2     Integer

In [ ]:
df_value_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   value_type_id  2 non-null      int64
 1   value_type     2 non-null      object
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

Insert into value_type table in database

In [ ]:
df_value_type.to_sql(name='value_type', con=engine, if_exists='append', index=False)

2

#### Create df_race

In [ ]:
df_race = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
df1.iloc[0:5, 8:12]
race_category = df1.iloc[0:5, 8:12].columns.tolist()
print(race_category)

['racepctblack', 'racePctWhite', 'racePctAsian', 'racePctHisp']

In [ ]:
df_race['race_category'] = race_category

In [ ]:
df_race.head()

  race_category
0  racepctblack
1  racePctWhite
2  racePctAsian
3   racePctHisp

Insert ID column

In [ ]:
df_race.insert(0, 'race_id', range(1, 1 + len(df_race)))

In [ ]:
df_race.head()

   race_id race_category
0        1  racepctblack
1        2  racePctWhite
2        3  racePctAsian
3        4   racePctHisp

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_race['value_type_id'] = np.where(df_race['race_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_race.head()

   race_id race_category  value_type_id
0        1  racepctblack              1
1        2  racePctWhite              1
2        3  racePctAsian              1
3        4   racePctHisp              1

Insert into race table in database

In [ ]:
df_race.to_sql(name='race', con=engine, if_exists='append', index=False)

4

#### Create df_community_race

Slice necessary columns

In [ ]:
df_community_race = df1.iloc[:, [0,8,9,10,11]]

pd.melt() to pivot longer

In [ ]:
df_community_race = pd.melt(df_community_race, id_vars = ['community_id'], value_vars=race_category)

In [ ]:
df_community_race.head()

   community_id      variable  value
0             1  racepctblack   1.37
1             2  racepctblack   0.80
2             3  racepctblack   0.74
3             4  racepctblack   1.70
4             5  racepctblack   0.53

Rename columns

In [ ]:
df_community_race = df_community_race.rename(columns = {"variable": "race_category",
                                             "value": "race_value"})

In [ ]:
df_community_race.head()

   community_id race_category  race_value
0             1  racepctblack        1.37
1             2  racepctblack        0.80
2             3  racepctblack        0.74
3             4  racepctblack        1.70
4             5  racepctblack        0.53

Join race_id by race_category

In [ ]:
df_community_race = df_community_race.merge(df_race[['race_category','race_id']], on='race_category')
df_community_race = df_community_race.drop(columns = ['race_category'])

In [ ]:
df_community_race.head()

   community_id  race_value  race_id
0             1        1.37        1
1             2        0.80        1
2             3        0.74        1
3             4        1.70        1
4             5        0.53        1

Reorder the column to be community_id, race_id, race_value

In [ ]:
df_community_race = df_community_race.iloc[:, [0,2,1]]

In [ ]:
df_community_race.head()

   community_id  race_id  race_value
0             1        1        1.37
1             2        1        0.80
2             3        1        0.74
3             4        1        1.70
4             5        1        0.53

In [ ]:
df_community_race.tail()

      community_id  race_id  race_value
8855          2211        4       29.86
8856          2212        4        1.29
8857          2213        4       11.00
8858          2214        4       62.11
8859          2215        4       24.43

Insert into community_race table in database

In [ ]:
df_community_race.to_sql(name='community_race', con=engine, if_exists='append', index=False)

860

#### Create df_urban

In [ ]:
df_urban = pd.DataFrame()

Slice necessary columns and convert to list of strings

In [ ]:
urban_category = df1[['pctUrban']].columns.to_list()

In [ ]:
df_urban['urban_category'] = urban_category

Insert id

In [ ]:
df_urban.insert(0, 'urban_id', range(1, 1 + len(df_urban)))

In [ ]:
df_urban.head()

   urban_id urban_category
0         1       pctUrban

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for Integer

In [ ]:
df_urban['value_type_id'] = np.where(df_urban['urban_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_urban.head()

   urban_id urban_category  value_type_id
0         1       pctUrban              1

Insert into race table in database

In [ ]:
df_urban.to_sql(name='urban', con=engine, if_exists='append', index=False)

1

#### Create df_community_urban

Slice necessary columns

In [ ]:
df_community_urban = df1[['community_id','pctUrban']]

In [ ]:
df_community_urban.head()

   community_id  pctUrban
0             1     100.0
1             2     100.0
2             3     100.0
3             4       0.0
4             5       0.0

pd.melt() to pivot longer

In [ ]:
df_community_urban = pd.melt(df_community_urban, id_vars = ['community_id'], value_vars = urban_category)

In [ ]:
df_community_urban.head()

   community_id  variable  value
0             1  pctUrban  100.0
1             2  pctUrban  100.0
2             3  pctUrban  100.0
3             4  pctUrban    0.0
4             5  pctUrban    0.0

Rename columns

In [ ]:
df_community_urban = df_community_urban.rename(columns = {"variable": "urban_category",
                                             "value": "urban_value"})

In [ ]:
df_community_urban.head()

   community_id urban_category  urban_value
0             1       pctUrban        100.0
1             2       pctUrban        100.0
2             3       pctUrban        100.0
3             4       pctUrban          0.0
4             5       pctUrban          0.0

Join urban_id by urban_category

In [ ]:
df_community_urban = df_community_urban.merge(df_urban[['urban_category','urban_id']], on='urban_category')
df_community_urban = df_community_urban.drop(columns = ['urban_category'])

In [ ]:
df_community_urban.head()

   community_id  urban_value  urban_id
0             1        100.0         1
1             2        100.0         1
2             3        100.0         1
3             4          0.0         1
4             5          0.0         1

Reorder the column

In [ ]:
df_community_urban = df_community_urban.iloc[:, [0,2,1]]

In [ ]:
df_community_urban.head()

   community_id  urban_id  urban_value
0             1         1        100.0
1             2         1        100.0
2             3         1        100.0
3             4         1          0.0
4             5         1          0.0

In [ ]:
df_community_urban.tail()

      community_id  urban_id  urban_value
2210          2211         1       100.00
2211          2212         1       100.00
2212          2213         1       100.00
2213          2214         1         0.00
2214          2215         1        99.19

Insert table into database

In [ ]:
df_community_urban.to_sql(name='community_urban', con=engine, if_exists='append', index=False)

215

#### Create df_housing_migration

In [ ]:
df_housing_migration = pd.DataFrame()

Slice necessary columns and convert to list of strings

In [ ]:
housing_migration_category = df1[['PctBornSameState', 'PctSameHouse85', 'PctSameCity85', 'PctSameState85']].columns.to_list()
housing_migration_category

['PctBornSameState', 'PctSameHouse85', 'PctSameCity85', 'PctSameState85']

In [ ]:
df_housing_migration['housing_migration_category'] = housing_migration_category

In [ ]:
df_housing_migration.head()

  housing_migration_category
0           PctBornSameState
1             PctSameHouse85
2              PctSameCity85
3             PctSameState85

Insert id

In [ ]:
df_housing_migration.insert(0, 'housing_migration_id', range(1, 1 + len(df_housing_migration)))

In [ ]:
df_housing_migration.head()

   housing_migration_id housing_migration_category
0                     1           PctBornSameState
1                     2             PctSameHouse85
2                     3              PctSameCity85
3                     4             PctSameState85

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for Integer

In [ ]:
df_housing_migration['value_type_id'] = np.where(df_housing_migration['housing_migration_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_housing_migration.head()

   housing_migration_id housing_migration_category  value_type_id
0                     1           PctBornSameState              1
1                     2             PctSameHouse85              1
2                     3              PctSameCity85              1
3                     4             PctSameState85              1

Insert into table in database

In [ ]:
df_housing_migration.head().to_sql(name='housing_migration', con=engine, if_exists='append', index=False)

4

#### Create df_community_housing_migration

Slice necessary columns

In [ ]:
df_community_housing_migration = df1[['community_id', 
                                      'PctBornSameState', 'PctSameHouse85', 'PctSameCity85', 'PctSameState85']]

In [ ]:
df_community_housing_migration.head()

,community_id,PctBornSameState,PctSameHouse85,PctSameCity85,PctSameState85
0,1,53.72,65.29,78.09,89.14
1,2,77.17,71.27,90.22,96.12
2,3,44.77,36.60,61.26,82.85
3,4,88.71,56.70,90.17,96.24
4,5,73.75,42.22,60.34,89.02

pd.melt() to pivot longer

In [ ]:
df_community_housing_migration = pd.melt(df_community_housing_migration, 
                                         id_vars = ['community_id'], 
                                         value_vars = housing_migration_category)
df_community_housing_migration.head()

   community_id          variable  value
0             1  PctBornSameState  53.72
1             2  PctBornSameState  77.17
2             3  PctBornSameState  44.77
3             4  PctBornSameState  88.71
4             5  PctBornSameState  73.75

Rename columns

In [ ]:
df_community_housing_migration = df_community_housing_migration.rename(columns = {"variable": "housing_migration_category",
                                             "value": "housing_migration_value"})

In [ ]:
df_community_housing_migration.head()

   community_id housing_migration_category  housing_migration_value
0             1           PctBornSameState                    53.72
1             2           PctBornSameState                    77.17
2             3           PctBornSameState                    44.77
3             4           PctBornSameState                    88.71
4             5           PctBornSameState                    73.75

Join housing_migration_id by housing_migration

In [ ]:
df_community_housing_migration = df_community_housing_migration.merge(df_housing_migration[['housing_migration_category','housing_migration_id']], on='housing_migration_category')
df_community_housing_migration = df_community_housing_migration.drop(columns = ['housing_migration_category'])

In [ ]:
df_community_housing_migration.head()

   community_id  housing_migration_value  housing_migration_id
0             1                    53.72                     1
1             2                    77.17                     1
2             3                    44.77                     1
3             4                    88.71                     1
4             5                    73.75                     1

Reorder the column

In [ ]:
df_community_housing_migration = df_community_housing_migration.iloc[:, [0,2,1]]

In [ ]:
df_community_housing_migration.head()

   community_id  housing_migration_id  housing_migration_value
0             1                     1                    53.72
1             2                     1                    77.17
2             3                     1                    44.77
3             4                     1                    88.71
4             5                     1                    73.75

In [ ]:
df_community_housing_migration.tail()

      community_id  housing_migration_id  housing_migration_value
8855          2211                     4                    85.88
8856          2212                     4                    92.85
8857          2213                     4                    92.30
8858          2214                     4                    94.06
8859          2215                     4                    89.08

Insert table into database

In [ ]:
df_community_housing_migration.to_sql(name='community_housing_migration', con=engine, if_exists='append', index=False)

860

#### Create df_community_statistics

In [ ]:
df_community_statistics = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
statistic_category = df1.iloc[0:5, 121:124].columns.tolist()
print(statistic_category)

['LandArea', 'PopDens', 'PctUsePubTrans']

In [ ]:
df_community_statistics['community_statistics_category'] = statistic_category

In [ ]:
df_community_statistics.head()

  community_statistics_category
0                      LandArea
1                       PopDens
2                PctUsePubTrans

Insert ID column

In [ ]:
df_community_statistics.insert(0, 'community_statistics_id', range(1, 1 + len(df_community_statistics)))

In [ ]:
df_community_statistics.head()

   community_statistics_id community_statistics_category
0                        1                      LandArea
1                        2                       PopDens
2                        3                PctUsePubTrans

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_community_statistics['value_type_id'] = np.where(df_community_statistics['community_statistics_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_community_statistics.head()

   community_statistics_id community_statistics_category  value_type_id
0                        1                      LandArea              2
1                        2                       PopDens              2
2                        3                PctUsePubTrans              1

Insert into community_statistics table in database

In [ ]:
df_community_statistics.to_sql(name='community_statistics', con=engine, if_exists='append', index=False)

3

#### Create df_community_community_statistics

Slice necessary columns

In [ ]:
df_community_community_statistics = df1.iloc[:, [0,121,122,123]]

pd.melt() to pivot longer

In [ ]:
df_community_community_statistics = pd.melt(df_community_community_statistics, id_vars = ['community_id'], value_vars=statistic_category)

In [ ]:
df_community_community_statistics.head()

   community_id  variable  value
0             1  LandArea    6.5
1             2  LandArea   10.6
2             3  LandArea   10.6
3             4  LandArea    5.2
4             5  LandArea   11.5

Rename columns

In [ ]:
df_community_community_statistics = df_community_community_statistics.rename(columns = {"variable": "community_statistics_category",
                                             "value": "community_statistics_value"})

In [ ]:
df_community_community_statistics = df_community_community_statistics.merge(df_community_statistics[['community_statistics_category','community_statistics_id']], on='community_statistics_category')
df_community_community_statistics = df_community_community_statistics.drop(columns = ['community_statistics_category'])

In [ ]:
df_community_community_statistics.head()

   community_id  community_statistics_value  community_statistics_id
0             1                         6.5                        1
1             2                        10.6                        1
2             3                        10.6                        1
3             4                         5.2                        1
4             5                        11.5                        1

Reorder the column to be community_id, community_statistics_id, community_statistics_value

In [ ]:
df_community_community_statistics = df_community_community_statistics.iloc[:, [0,2,1]]

In [ ]:
df_community_community_statistics.tail()

      community_id  community_statistics_id  community_statistics_value
6640          2211                        3                        0.59
6641          2212                        3                        1.15
6642          2213                        3                        0.12
6643          2214                        3                        0.00
6644          2215                        3                        1.39

Insert into community_community_statistics table in database

In [ ]:
df_community_community_statistics.to_sql(name='community_community_statistics', con=engine, if_exists='append', index=False)

645

#### Create df_police_operations

In [ ]:
df_police_operations = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
columns = [119, 125, 129]
police_operations_category = df1.iloc[0:5, columns].columns.tolist()
print(police_operations_category)

['NumKindsDrugsSeiz', 'PolicOperBudg', 'PolicBudgPerPop']

In [ ]:
df_police_operations['police_operations_category'] = police_operations_category

In [ ]:
df_police_operations.head()

  police_operations_category
0          NumKindsDrugsSeiz
1              PolicOperBudg
2            PolicBudgPerPop

Insert ID column

In [ ]:
df_police_operations.insert(0, 'police_operations_id', range(1, 1 + len(df_police_operations)))

In [ ]:
df_police_operations.head()

   police_operations_id police_operations_category
0                     1          NumKindsDrugsSeiz
1                     2              PolicOperBudg
2                     3            PolicBudgPerPop

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_police_operations['value_type_id'] = np.where(df_police_operations['police_operations_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_police_operations.head()

   police_operations_id police_operations_category  value_type_id
0                     1          NumKindsDrugsSeiz              2
1                     2              PolicOperBudg              2
2                     3            PolicBudgPerPop              2

Insert into police_operations table in database

In [ ]:
df_police_operations.to_sql(name='police_operations', con=engine, if_exists='append', index=False)

3

#### Create df_community_police_operations

Slice necessary columns

In [ ]:
df_community_police_operations = df1.iloc[:, [0, 119, 125, 129]]

pd.melt() to pivot longer

In [ ]:
df_community_police_operations = pd.melt(df_community_police_operations, id_vars = ['community_id'], value_vars=police_operations_category)

In [ ]:
df_community_police_operations.head()

   community_id           variable  value
0             1  NumKindsDrugsSeiz   -1.0
1             2  NumKindsDrugsSeiz   -1.0
2             3  NumKindsDrugsSeiz   -1.0
3             4  NumKindsDrugsSeiz   -1.0
4             5  NumKindsDrugsSeiz   -1.0

Rename columns

In [ ]:
df_community_police_operations = df_community_police_operations.rename(columns = {"variable": "police_operations_category",
                                             "value": "police_operations_value"})

In [ ]:
df_community_police_operations.head()

   community_id police_operations_category  police_operations_value
0             1          NumKindsDrugsSeiz                     -1.0
1             2          NumKindsDrugsSeiz                     -1.0
2             3          NumKindsDrugsSeiz                     -1.0
3             4          NumKindsDrugsSeiz                     -1.0
4             5          NumKindsDrugsSeiz                     -1.0

Join police_operations_id by police_operations_category

In [ ]:
df_community_police_operations = df_community_police_operations.merge(df_police_operations[['police_operations_category','police_operations_id']], on='police_operations_category')
df_community_police_operations = df_community_police_operations.drop(columns = ['police_operations_category'])

In [ ]:
df_community_police_operations.head()

   community_id  police_operations_value  police_operations_id
0             1                     -1.0                     1
1             2                     -1.0                     1
2             3                     -1.0                     1
3             4                     -1.0                     1
4             5                     -1.0                     1

Reorder the column to be community_id, police_operations_id, police_operations_value

In [ ]:
df_community_police_operations = df_community_police_operations.iloc[:, [0,2,1]]

In [ ]:
df_community_police_operations.tail()

      community_id  police_operations_id  police_operations_value
6640          2211                     3                     -1.0
6641          2212                     3                     -1.0
6642          2213                     3                     -1.0
6643          2214                     3                     -1.0
6644          2215                     3                     -1.0

Insert into community_police_operations table in database

In [ ]:
df_community_police_operations.to_sql(name='community_police_operations', con=engine, if_exists='append', index=False)

645

#### Create df_income

In [ ]:
df_income = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
income_category = df1.iloc[0:5, 18:27].columns.tolist()
print(income_category)

['medIncome', 'pctWWage', 'pctWFarmSelf', 'pctWInvInc', 'pctWSocSec', 'pctWPubAsst', 'pctWRetire', 'medFamInc', 'perCapInc']

In [ ]:
df_income['income_category'] = income_category

In [ ]:
df_income.head(9)

  income_category
0       medIncome
1        pctWWage
2    pctWFarmSelf
3      pctWInvInc
4      pctWSocSec
5     pctWPubAsst
6      pctWRetire
7       medFamInc
8       perCapInc

Insert ID column

In [ ]:
df_income.insert(0, 'income_id', range(1, 1 + len(df_income)))

In [ ]:
df_income.head()

   income_id income_category
0          1       medIncome
1          2        pctWWage
2          3    pctWFarmSelf
3          4      pctWInvInc
4          5      pctWSocSec

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_income['value_type_id'] = np.where(df_income['income_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_income.head(9)

   income_id income_category  value_type_id
0          1       medIncome              2
1          2        pctWWage              1
2          3    pctWFarmSelf              1
3          4      pctWInvInc              1
4          5      pctWSocSec              1
5          6     pctWPubAsst              1
6          7      pctWRetire              1
7          8       medFamInc              2
8          9       perCapInc              2

Insert into income table in database

In [ ]:
df_income.to_sql(name='income', con=engine, if_exists='append', index=False)

9

#### Create df_community_income

Slice necessary columns

In [ ]:
df_community_income = df1.iloc[:, [0,18,19,20,21,22,23,24,25,26]]

pd.melt() to pivot longer

In [ ]:
df_community_income = pd.melt(df_community_income, id_vars = ['community_id'], value_vars=income_category)

In [ ]:
df_community_income.head()

   community_id   variable    value
0             1  medIncome  75122.0
1             2  medIncome  47917.0
2             3  medIncome  35669.0
3             4  medIncome  20580.0
4             5  medIncome  17390.0

Rename columns

In [ ]:
df_community_income = df_community_income.rename(columns = {"variable": "income_category",
                                             "value": "income_value"})

In [ ]:
df_community_income.head()

   community_id income_category  income_value
0             1       medIncome       75122.0
1             2       medIncome       47917.0
2             3       medIncome       35669.0
3             4       medIncome       20580.0
4             5       medIncome       17390.0

Join income_id by income_category

In [ ]:
df_community_income = df_community_income.merge(df_income[['income_category','income_id']], on='income_category')
df_community_income = df_community_income.drop(columns = ['income_category'])

In [ ]:
df_community_income.head()

   community_id  income_value  income_id
0             1       75122.0          1
1             2       47917.0          1
2             3       35669.0          1
3             4       20580.0          1
4             5       17390.0          1

Reorder the column to be community_id, income_id, income_value

In [ ]:
df_community_income = df_community_income.iloc[:, [0,2,1]]

In [ ]:
df_community_income.tail()

       community_id  income_id  income_value
19930          2211          9       10237.0
19931          2212          9        9995.0
19932          2213          9       14131.0
19933          2214          9        8100.0
19934          2215          9       11510.0

Insert into community_income table in database

In [ ]:
df_community_income.to_sql(name='community_income', con=engine, if_exists='append', index=False)

935

#### Create df_immigration

In [ ]:
df_immigration = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
columns = [57, 58, 59, 60, 61, 62, 63, 64, 65, 99]
immigration_category = df1.iloc[0:5, columns].columns.tolist()
print(immigration_category)

['NumImmig', 'PctImmigRecent', 'PctImmigRec5', 'PctImmigRec8', 'PctImmigRec10', 'PctRecentImmig', 'PctRecImmig5', 'PctRecImmig8', 'PctRecImmig10', 'PctForeignBorn']

In [ ]:
df_immigration['immigration_category'] = immigration_category

In [ ]:
df_immigration.head(10)

  immigration_category
0             NumImmig
1       PctImmigRecent
2         PctImmigRec5
3         PctImmigRec8
4        PctImmigRec10
5       PctRecentImmig
6         PctRecImmig5
7         PctRecImmig8
8        PctRecImmig10
9       PctForeignBorn

Insert ID column

In [ ]:
df_immigration.insert(0, 'immigration_id', range(1, 1 + len(df_immigration)))

In [ ]:
df_immigration.head()

   immigration_id immigration_category
0               1             NumImmig
1               2       PctImmigRecent
2               3         PctImmigRec5
3               4         PctImmigRec8
4               5        PctImmigRec10

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_immigration['value_type_id'] = np.where(df_immigration['immigration_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_immigration.head(10)

   immigration_id immigration_category  value_type_id
0               1             NumImmig              2
1               2       PctImmigRecent              1
2               3         PctImmigRec5              1
3               4         PctImmigRec8              1
4               5        PctImmigRec10              1
5               6       PctRecentImmig              1
6               7         PctRecImmig5              1
7               8         PctRecImmig8              1
8               9        PctRecImmig10              1
9              10       PctForeignBorn              1

Insert into immigration table in database

In [ ]:
df_immigration.to_sql(name='immigration', con=engine, if_exists='append', index=False)

10

#### Create df_community_immigration

Slice necessary columns

In [ ]:
df_community_immigration = df1.iloc[:, [0, 57, 58, 59, 60, 61, 62, 63, 64, 65, 99]]

pd.melt() to pivot longer

In [ ]:
df_community_immigration = pd.melt(df_community_immigration, id_vars = ['community_id'], value_vars=immigration_category)

In [ ]:
df_community_immigration.head()

   community_id  variable   value
0             1  NumImmig  1277.0
1             2  NumImmig  1920.0
2             3  NumImmig  1468.0
3             4  NumImmig   339.0
4             5  NumImmig   196.0

Rename columns

In [ ]:
df_community_immigration = df_community_immigration.rename(columns = {"variable": "immigration_category",
                                             "value": "immigration_value"})

In [ ]:
df_community_immigration.head()

   community_id immigration_category  immigration_value
0             1             NumImmig             1277.0
1             2             NumImmig             1920.0
2             3             NumImmig             1468.0
3             4             NumImmig              339.0
4             5             NumImmig              196.0

Join immigration_id by immigration_category

In [ ]:
df_community_immigration = df_community_immigration.merge(df_immigration[['immigration_category','immigration_id']], on='immigration_category')
df_community_immigration = df_community_immigration.drop(columns = ['immigration_category'])

In [ ]:
df_community_immigration.head()

   community_id  immigration_value  immigration_id
0             1             1277.0               1
1             2             1920.0               1
2             3             1468.0               1
3             4              339.0               1
4             5              196.0               1

Reorder the column to be community_id, immigration_id, immigration_value

In [ ]:
df_community_immigration = df_community_immigration.iloc[:, [0,2,1]]

In [ ]:
df_community_immigration.tail()

       community_id  immigration_id  immigration_value
22145          2211              10              18.90
22146          2212              10               2.24
22147          2213              10               7.35
22148          2214              10               2.28
22149          2215              10              16.49

Insert into community_immigration table in database

In [ ]:
df_community_immigration.to_sql(name='community_immigration', con=engine, if_exists='append', index=False)

150

### Create df_income_race

In [ ]:
df_income_race = pd.DataFrame()

In [ ]:
df1

,community_id,communityname,state,countyCode,communityCode,fold,population,householdsize,racepctblack,racePctWhite,...,burglaries,burglPerPop,larcenies,larcPerPop,autoTheft,autoTheftPerPop,arsons,arsonsPerPop,ViolentCrimesPerPop,nonViolPerPop
0,1,BerkeleyHeightstownship,NJ,39.0,5320.0,1.0,11980.0,3.10,1.37,91.78,...,14.0,114.85,138.0,1132.08,16.0,131.26,2.0,16.41,41.02,1394.59
1,2,Marpletownship,PA,45.0,47616.0,1.0,23123.0,2.82,0.80,95.57,...,57.0,242.37,376.0,1598.78,26.0,110.55,1.0,4.25,127.56,1955.95
2,3,Tigardcity,OR,-1.0,-1.0,1.0,29344.0,2.43,0.74,94.33,...,274.0,758.14,1797.0,4972.19,136.0,376.30,22.0,60.87,218.59,6167.51
3,4,Gloversvillecity,NY,35.0,29443.0,1.0,16656.0,2.40,1.70,97.35,...,225.0,1301.78,716.0,4142.56,47.0,271.93,-1.0,-1.00,306.64,-1.00
4,5,Bemidjicity,MN,7.0,5068.0,1.0,11245.0,2.76,0.53,89.16,...,91.0,728.93,1060.0,8490.87,91.0,728.93,5.0,40.05,-1.00,9988.79
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2210,2211,Mercedcity,CA,-1.0,-1.0,10.0,56216.0,3.07,6.87,61.68,...,1376.0,2268.72,2563.0,4225.82,489.0,806.25,34.0,56.06,545.75,7356.84
2211,2212,Pinevillecity,LA,-1.0,-1.0,10.0,12251.0,2.68,21.18,76.65,...,104.0,860.43,574.0,4748.90,24.0,198.56,2.0,16.55,124.10,5824.44
2212,2213,Yucaipacity,CA,-1.0,-1.0,10.0,32824.0,2.46,0.52,92.62,...,628.0,1709.26,895.0,2435.97,179.0,487.19,8.0,21.77,353.83,4654.20
2213,2214,Beevillecity,TX,-1.0,-1.0,10.0,13547.0,2.89,3.37,69.91,...,192.0,1508.01,474.0,3722.90,13.0,102.10,1.0,7.85,691.17,5340.87
2214,2215,WestSacramentocity,CA,-1.0,-1.0,10.0,28898.0,2.61,2.39,71.27,...,791.0,2614.53,1458.0,4819.20,405.0,1338.67,20.0,66.11,918.89,8838.50

In [ ]:
income_race_category = df1.iloc[0:5, 27:33].columns.tolist()
print(income_race_category)

['whitePerCap', 'blackPerCap', 'indianPerCap', 'AsianPerCap', 'OtherPerCap', 'HispPerCap']

In [ ]:
df_income_race['inc_race_category'] = income_race_category

In [ ]:
df_income_race.head()

  inc_race_category
0       whitePerCap
1       blackPerCap
2      indianPerCap
3       AsianPerCap
4       OtherPerCap

#### Insert ID Column

In [ ]:
df_income_race.insert(0, 'income_race_id', range(1, 1 + len(df_income_race)))
df_income_race.head()

   income_race_id inc_race_category
0               1       whitePerCap
1               2       blackPerCap
2               3      indianPerCap
3               4       AsianPerCap
4               5       OtherPerCap

#### Create value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_income_race['value_type_id'] = np.where(df_income_race['inc_race_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_income_race.head()

   income_race_id inc_race_category  value_type_id
0               1       whitePerCap              2
1               2       blackPerCap              2
2               3      indianPerCap              2
3               4       AsianPerCap              2
4               5       OtherPerCap              2

#### Insert into income_race table

In [ ]:
df_income_race.to_sql(name='income_race', con=engine, if_exists='append', index=False)

6

### create df_community_income_race

In [ ]:
df_community_income_race = df1.iloc[:,[0,27,28,29,30,31,32]]

#### pd.melt() to pivot longer

In [ ]:
df_community_income_race = pd.melt(df_community_income_race, id_vars = ['community_id'], value_vars=income_race_category)

In [ ]:
df_community_income_race.head()

   community_id     variable    value
0             1  whitePerCap  30233.0
1             2  whitePerCap  20191.0
2             3  whitePerCap  17103.0
3             4  whitePerCap  10909.0
4             5  whitePerCap   9009.0

#### rename columns

In [ ]:
df_community_income_race = df_community_income_race.rename(columns = {"variable": "inc_race_category", "value":"income_race_value"})

In [ ]:
df_community_income_race = df_community_income_race.merge(df_income_race[['inc_race_category', 'income_race_id']], on ='inc_race_category')
df_community_income_race = df_community_income_race.drop(columns = ['inc_race_category'])

In [ ]:
df_community_income_race.head()

   community_id  income_race_value  income_race_id
0             1            30233.0               1
1             2            20191.0               1
2             3            17103.0               1
3             4            10909.0               1
4             5             9009.0               1

#### reorder columns to be community_id, income_race_id, income_race_value

In [ ]:
df_community_income_race = df_community_income_race.iloc[:,[0,2,1]]
df_community_income_race.tail()

       community_id  income_race_id  income_race_value
13285          2211               6             6644.0
13286          2212               6             4883.0
13287          2213               6             9398.0
13288          2214               6             5338.0
13289          2215               6             8275.0

#### insert to database

In [ ]:
df_community_income_race.to_sql(name='community_income_race', con=engine, if_exists='append', index=False)

290

### Create languages table

In [ ]:
df_languages = pd.DataFrame()

In [ ]:
language_category = df1.iloc[0:5, 66:68].columns.tolist()
print(language_category)

['PctSpeakEnglOnly', 'PctNotSpeakEnglWell']

In [ ]:
df_languages['language_category'] = language_category

#### insert ID column

In [ ]:
df_languages.insert(0, 'language_id', range(1, 1 + len(df_languages)))

In [ ]:
#create value_type_id
df_languages['value_type_id'] = np.where(df_languages['language_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_languages

   language_id    language_category  value_type_id
0            1     PctSpeakEnglOnly              1
1            2  PctNotSpeakEnglWell              1

In [ ]:
#Insert into languages database
df_languages.to_sql(name='languages', con=engine, if_exists='append', index=False)

2

### Create community_languages table

In [ ]:
df_community_languages = df1.iloc[:, [0, 66,67]]

#### pd.melt() to pivot longer

In [ ]:
df_community_languages = pd.melt(df_community_languages, id_vars = ['community_id'], value_vars=language_category)

In [ ]:
df_community_languages

      community_id             variable  value
0                1     PctSpeakEnglOnly  85.68
1                2     PctSpeakEnglOnly  87.79
2                3     PctSpeakEnglOnly  93.11
3                4     PctSpeakEnglOnly  94.98
4                5     PctSpeakEnglOnly  94.64
...            ...                  ...    ...
4425          2211  PctNotSpeakEnglWell  11.87
4426          2212  PctNotSpeakEnglWell   0.86
4427          2213  PctNotSpeakEnglWell   1.70
4428          2214  PctNotSpeakEnglWell   6.66
4429          2215  PctNotSpeakEnglWell   7.76

[4430 rows x 3 columns]

#### Rename columns

In [ ]:
df_community_languages = df_community_languages.rename(columns = {"variable": "language_category",
                                             "value": "language_value"})
df_community_languages

      community_id    language_category  language_value
0                1     PctSpeakEnglOnly           85.68
1                2     PctSpeakEnglOnly           87.79
2                3     PctSpeakEnglOnly           93.11
3                4     PctSpeakEnglOnly           94.98
4                5     PctSpeakEnglOnly           94.64
...            ...                  ...             ...
4425          2211  PctNotSpeakEnglWell           11.87
4426          2212  PctNotSpeakEnglWell            0.86
4427          2213  PctNotSpeakEnglWell            1.70
4428          2214  PctNotSpeakEnglWell            6.66
4429          2215  PctNotSpeakEnglWell            7.76

[4430 rows x 3 columns]

#### join language_id by language_category and reorder columns

In [ ]:
df_community_languages = df_community_languages.merge(df_languages[['language_category','language_id']], on='language_category')
df_community_languages = df_community_languages.drop(columns = ['language_category'])
df_community_languages = df_community_languages.iloc[:, [0,2,1]]
df_community_languages

      community_id  language_id  language_value
0                1            1           85.68
1                2            1           87.79
2                3            1           93.11
3                4            1           94.98
4                5            1           94.64
...            ...          ...             ...
4425          2211            2           11.87
4426          2212            2            0.86
4427          2213            2            1.70
4428          2214            2            6.66
4429          2215            2            7.76

[4430 rows x 3 columns]

#### insert into community_language table in database

In [ ]:
df_community_languages.to_sql(name='community_languages', con=engine, if_exists='append', index=False)

430

### Create homeless table

In [ ]:
df_homeless = pd.DataFrame()

#### Slice necessary columns and convert to list as string for category column

In [ ]:
homeless_category = df1.iloc[0:5, 97:99].columns.tolist()
print(homeless_category)

['NumInShelters', 'NumStreet']

In [ ]:
df_homeless['homeless_category'] = homeless_category

#### Insert ID Column

In [ ]:
df_homeless.insert(0, 'homeless_id', range(1, 1 + len(df_homeless)))

#### Create value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_homeless['value_type_id'] = np.where(df_homeless['homeless_category'].str.contains('pct|Pct'), 1, 2)
df_homeless.head()

   homeless_id homeless_category  value_type_id
0            1     NumInShelters              2
1            2         NumStreet              2

#### Insert to homeless database

In [ ]:
df_homeless.to_sql(name='homeless', con=engine, if_exists='append', index=False)

2

### Create community_homeless df

In [ ]:
df_community_homeless = df1.iloc[:, [0,97,98]]

#### pd.melt() to pivot longer

In [ ]:
df_community_homeless = pd.melt(df_community_homeless, id_vars = ['community_id'], value_vars=homeless_category)

#### rename columns

In [ ]:
df_community_homeless = df_community_homeless.rename(columns = {"variable": "homeless_category",
                                             "value": "homeless_value"})

In [ ]:
df_community_homeless

      community_id homeless_category  homeless_value
0                1     NumInShelters            11.0
1                2     NumInShelters             0.0
2                3     NumInShelters            16.0
3                4     NumInShelters             0.0
4                5     NumInShelters             2.0
...            ...               ...             ...
4425          2211         NumStreet             0.0
4426          2212         NumStreet             0.0
4427          2213         NumStreet             0.0
4428          2214         NumStreet             0.0
4429          2215         NumStreet             2.0

[4430 rows x 3 columns]

#### Join homeless_id by homeless_category and drop unnecessary column

In [ ]:
df_community_homeless = df_community_homeless.merge(df_homeless[['homeless_category','homeless_id']], on='homeless_category')
df_community_homeless = df_community_homeless.drop(columns = ['homeless_category'])

In [ ]:
df_community_homeless.head()

   community_id  homeless_value  homeless_id
0             1            11.0            1
1             2             0.0            1
2             3            16.0            1
3             4             0.0            1
4             5             2.0            1

#### Reorder columns to community_id,homeless_id,homeless_value

In [ ]:
df_community_homeless = df_community_homeless.iloc[:, [0,2,1]]

In [ ]:
df_community_homeless

      community_id  homeless_id  homeless_value
0                1            1            11.0
1                2            1             0.0
2                3            1            16.0
3                4            1             0.0
4                5            1             2.0
...            ...          ...             ...
4425          2211            2             0.0
4426          2212            2             0.0
4427          2213            2             0.0
4428          2214            2             0.0
4429          2215            2             2.0

[4430 rows x 3 columns]

#### insert to community_homeless table in database

In [ ]:
df_community_homeless.to_sql(name='community_homeless', con=engine, if_exists='append', index=False)

430

### Create crimes table

In [ ]:
df_crimes = pd.DataFrame()

In [ ]:
crimecolumns = [131, 133, 135, 137, 139, 141, 143, 145, 146, 147]

In [ ]:
crimes_category = df1.iloc[0:5, crimecolumns].columns.tolist()
print(crimes_category)

['murdPerPop', 'rapesPerPop', 'robbbPerPop', 'assaultPerPop', 'burglPerPop', 'larcPerPop', 'autoTheftPerPop', 'arsonsPerPop', 'ViolentCrimesPerPop', 'nonViolPerPop']

In [ ]:
df_crimes['crimes_category'] = crimes_category
df_crimes.head()

  crimes_category
0      murdPerPop
1     rapesPerPop
2     robbbPerPop
3   assaultPerPop
4     burglPerPop

#### insert ID column

In [ ]:
df_crimes.insert(0, 'crimes_id', range(1, 1 + len(df_crimes)))
df_crimes.head()

   crimes_id crimes_category
0          1      murdPerPop
1          2     rapesPerPop
2          3     robbbPerPop
3          4   assaultPerPop
4          5     burglPerPop

#### create value_type_id

In [ ]:
df_crimes['value_type_id'] = np.where(df_crimes['crimes_category'].str.contains('pct|Pct'), 1, 2)
df_crimes.head()

   crimes_id crimes_category  value_type_id
0          1      murdPerPop              2
1          2     rapesPerPop              2
2          3     robbbPerPop              2
3          4   assaultPerPop              2
4          5     burglPerPop              2

#### insert into crimes table in database

In [ ]:
df_crimes.to_sql(name='crimes', con=engine, if_exists='append', index=False)

10

### create community_crimes table

In [ ]:
df_community_crimes = df1.iloc[:, [0, 131, 133, 135, 137, 139, 141, 143, 145, 146, 147]]

#### pd.melt() to pivot longer

In [ ]:
df_community_crimes = pd.melt(df_community_crimes, id_vars = ['community_id'], value_vars=crimes_category)
df_community_crimes

       community_id       variable    value
0                 1     murdPerPop     0.00
1                 2     murdPerPop     0.00
2                 3     murdPerPop     8.30
3                 4     murdPerPop     0.00
4                 5     murdPerPop     0.00
...             ...            ...      ...
22145          2211  nonViolPerPop  7356.84
22146          2212  nonViolPerPop  5824.44
22147          2213  nonViolPerPop  4654.20
22148          2214  nonViolPerPop  5340.87
22149          2215  nonViolPerPop  8838.50

[22150 rows x 3 columns]

#### rename columns

In [ ]:
df_community_crimes = df_community_crimes.rename(columns = {"variable": "crimes_category",
                                             "value": "crimes_value"})

In [ ]:
df_community_crimes.head()

   community_id crimes_category  crimes_value
0             1      murdPerPop           0.0
1             2      murdPerPop           0.0
2             3      murdPerPop           8.3
3             4      murdPerPop           0.0
4             5      murdPerPop           0.0

#### Join crimes_id by crimes_category and reorder columns

In [ ]:
df_community_crimes = df_community_crimes.merge(df_crimes[['crimes_category','crimes_id']], on='crimes_category')
df_community_crimes = df_community_crimes.drop(columns = ['crimes_category'])
df_community_crimes = df_community_crimes.iloc[:, [0,2,1]]
df_community_crimes.head()

   community_id  crimes_id  crimes_value
0             1          1           0.0
1             2          1           0.0
2             3          1           8.3
3             4          1           0.0
4             5          1           0.0

#### Insert into community_crimes table in database

In [ ]:
df_community_crimes.to_sql(name='community_crimes', con=engine, if_exists='append', index=False)

150

#### Create df_police_force

In [ ]:
df_police_force = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
police_force_category = df1[['LemasSwornFT', 'LemasSwFTPerPop', 'LemasSwFTFieldOps', 'LemasSwFTFieldPerPop','LemasPctPolicOnPatr','OfficAssgnDrugUnits','LemasPctOfficDrugUn','PolicAveOTWorked','PolicCars','PolicPerPop']].columns.to_list()
print(police_force_category)

['LemasSwornFT', 'LemasSwFTPerPop', 'LemasSwFTFieldOps', 'LemasSwFTFieldPerPop', 'LemasPctPolicOnPatr', 'OfficAssgnDrugUnits', 'LemasPctOfficDrugUn', 'PolicAveOTWorked', 'PolicCars', 'PolicPerPop']

In [ ]:
df_police_force['police_force_category'] = police_force_category

In [ ]:
df_police_force.head()

  police_force_category
0          LemasSwornFT
1       LemasSwFTPerPop
2     LemasSwFTFieldOps
3  LemasSwFTFieldPerPop
4   LemasPctPolicOnPatr

Insert ID column

In [ ]:
df_police_force.insert(0, 'police_force_id', range(1, 1 + len(df_police_force)))

In [ ]:
df_police_force.head()

   police_force_id police_force_category
0                1          LemasSwornFT
1                2       LemasSwFTPerPop
2                3     LemasSwFTFieldOps
3                4  LemasSwFTFieldPerPop
4                5   LemasPctPolicOnPatr

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_police_force['value_type_id'] = np.where(df_police_force['police_force_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_police_force.head()

   police_force_id police_force_category  value_type_id
0                1          LemasSwornFT              2
1                2       LemasSwFTPerPop              2
2                3     LemasSwFTFieldOps              2
3                4  LemasSwFTFieldPerPop              2
4                5   LemasPctPolicOnPatr              1

Insert into police_force table in database

In [ ]:
df_police_force.to_sql(name='police_force', con=engine, if_exists='append', index=False)

10

#### Create df_community_police_force

Slice necessary columns

In [ ]:
df_community_police_force = df1[['community_id','LemasSwornFT', 'LemasSwFTPerPop', 'LemasSwFTFieldOps', 'LemasSwFTFieldPerPop','LemasPctPolicOnPatr','OfficAssgnDrugUnits','LemasPctOfficDrugUn','PolicAveOTWorked','PolicCars','PolicPerPop']]

pd.melt() to pivot longer

In [ ]:
df_community_police_force = pd.melt(df_community_police_force, id_vars = ['community_id'], value_vars=police_force_category)

In [ ]:
df_community_police_force.head()

   community_id      variable  value
0             1  LemasSwornFT   -1.0
1             2  LemasSwornFT   -1.0
2             3  LemasSwornFT   -1.0
3             4  LemasSwornFT   -1.0
4             5  LemasSwornFT   -1.0

Rename columns

In [ ]:
df_community_police_force = df_community_police_force.rename(columns = {"variable": "police_force_category",
                                             "value": "police_force_value"})

In [ ]:
df_community_police_force.head()

   community_id police_force_category  police_force_value
0             1          LemasSwornFT                -1.0
1             2          LemasSwornFT                -1.0
2             3          LemasSwornFT                -1.0
3             4          LemasSwornFT                -1.0
4             5          LemasSwornFT                -1.0

Join police_force_id by police_force_category

In [ ]:
df_community_police_force = df_community_police_force.merge(df_police_force[['police_force_category','police_force_id']], on='police_force_category')
df_community_police_force = df_community_police_force.drop(columns = ['police_force_category'])

In [ ]:
df_community_police_force.head()

   community_id  police_force_value  police_force_id
0             1                -1.0                1
1             2                -1.0                1
2             3                -1.0                1
3             4                -1.0                1
4             5                -1.0                1

Reorder the column to be community_id, police_force_id, police_force_value

In [ ]:
df_community_police_force = df_community_police_force.iloc[:, [0,2,1]]

In [ ]:
df_community_police_force.tail()

       community_id  police_force_id  police_force_value
22145          2211               10                -1.0
22146          2212               10                -1.0
22147          2213               10                -1.0
22148          2214               10                -1.0
22149          2215               10                -1.0

Insert into community_police_force table in database

In [ ]:
df_community_police_force.to_sql(name='community_police_force', con=engine, if_exists='append', index=False)

150

#### Create df_education

In [ ]:
df_education = pd.DataFrame()

Slice necessary columns and convert to list of strings

In [ ]:
education_category = df1[['PctLess9thGrade','PctNotHSGrad','PctBSorMore']].columns.to_list()

In [ ]:
df_education['education_category'] = education_category

Insert id

In [ ]:
df_education.insert(0, 'education_id', range(1, 1 + len(df_education)))

In [ ]:
df_education.head()

   education_id education_category
0             1    PctLess9thGrade
1             2       PctNotHSGrad
2             3        PctBSorMore

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for Integer

In [ ]:
df_education['value_type_id'] = np.where(df_education['education_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_education.head()

   education_id education_category  value_type_id
0             1    PctLess9thGrade              1
1             2       PctNotHSGrad              1
2             3        PctBSorMore              1

Insert into education table in database

In [ ]:
df_education.to_sql(name='education', con=engine, if_exists='append', index=False)

3

#### Create df_community_education

Slice necessary columns

In [ ]:
df_community_education = df1[['community_id','PctLess9thGrade','PctNotHSGrad','PctBSorMore']]

In [ ]:
df_community_education.head()

   community_id  PctLess9thGrade  PctNotHSGrad  PctBSorMore
0             1             5.81          9.90        48.18
1             2             5.61         13.72        29.89
2             3             2.80          9.09        30.13
3             4            11.05         33.68        10.81
4             5            12.15         23.06        25.28

pd.melt() to pivot longer

In [ ]:
df_community_education = pd.melt(df_community_education, id_vars = ['community_id'], value_vars = education_category)

In [ ]:
df_community_education.head()

   community_id         variable  value
0             1  PctLess9thGrade   5.81
1             2  PctLess9thGrade   5.61
2             3  PctLess9thGrade   2.80
3             4  PctLess9thGrade  11.05
4             5  PctLess9thGrade  12.15

Rename columns

In [ ]:
df_community_education = df_community_education.rename(columns = {"variable": "education_category",
                                             "value": "education_value"})

In [ ]:
df_community_education.head()

   community_id education_category  education_value
0             1    PctLess9thGrade             5.81
1             2    PctLess9thGrade             5.61
2             3    PctLess9thGrade             2.80
3             4    PctLess9thGrade            11.05
4             5    PctLess9thGrade            12.15

Join urban_id by education_category

In [ ]:
df_community_education = df_community_education.merge(df_education[['education_category','education_id']], on='education_category')
df_community_education = df_community_education.drop(columns = ['education_category'])

In [ ]:
df_community_education.head()

   community_id  education_value  education_id
0             1             5.81             1
1             2             5.61             1
2             3             2.80             1
3             4            11.05             1
4             5            12.15             1

Reorder the column

In [ ]:
df_community_education = df_community_education.iloc[:, [0,2,1]]

In [ ]:
df_community_education.head()

   community_id  education_id  education_value
0             1             1             5.81
1             2             1             5.61
2             3             1             2.80
3             4             1            11.05
4             5             1            12.15

In [ ]:
df_community_education.tail()

      community_id  education_id  education_value
6640          2211             3            15.79
6641          2212             3            19.28
6642          2213             3            12.42
6643          2214             3            12.40
6644          2215             3             8.86

Insert table into database

In [ ]:
df_community_education.to_sql(name='community_education', con=engine, if_exists='append', index=False)

645

#### Create df_community_housing_info

In [ ]:
df_community_housing_info = pd.DataFrame()

Slice necessary columns and convert to list of strings

In [ ]:
community_housing_info_category = df1[['householdsize', 'PctLargHouseFam', 'PctLargHouseOccup', 'PersPerOccupHous','PersPerOwnOccHous','PersPerRentOccHous','PctPersOwnOccup','PctPersDenseHous','PctHousLess3BR','MedNumBR','HousVacant','PctHousOccup','PctHousOwnOcc','PctVacantBoarded','PctVacMore6Mos','MedYrHousBuilt','PctHousNoPhone','PctWOFullPlumb']].columns.to_list()
community_housing_info_category

['householdsize',
 'PctLargHouseFam',
 'PctLargHouseOccup',
 'PersPerOccupHous',
 'PersPerOwnOccHous',
 'PersPerRentOccHous',
 'PctPersOwnOccup',
 'PctPersDenseHous',
 'PctHousLess3BR',
 'MedNumBR',
 'HousVacant',
 'PctHousOccup',
 'PctHousOwnOcc',
 'PctVacantBoarded',
 'PctVacMore6Mos',
 'MedYrHousBuilt',
 'PctHousNoPhone',
 'PctWOFullPlumb']

In [ ]:
df_community_housing_info['community_housing_category'] = community_housing_info_category

In [ ]:
df_community_housing_info.head()

  community_housing_category
0              householdsize
1            PctLargHouseFam
2          PctLargHouseOccup
3           PersPerOccupHous
4          PersPerOwnOccHous

Insert id

In [ ]:
df_community_housing_info.insert(0, 'community_housing_info_id', range(1, 1 + len(df_community_housing_info)))

In [ ]:
df_community_housing_info

    community_housing_info_id community_housing_category
0                           1              householdsize
1                           2            PctLargHouseFam
2                           3          PctLargHouseOccup
3                           4           PersPerOccupHous
4                           5          PersPerOwnOccHous
5                           6         PersPerRentOccHous
6                           7            PctPersOwnOccup
7                           8           PctPersDenseHous
8                           9             PctHousLess3BR
9                          10                   MedNumBR
10                         11                 HousVacant
11                         12               PctHousOccup
12                         13              PctHousOwnOcc
13                         14           PctVacantBoarded
14                         15             PctVacMore6Mos
15                         16             MedYrHousBuilt
16                         17             PctHousNoPhone
17                         18             PctWOFullPlumb

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for Integer

In [ ]:
df_community_housing_info['value_type_id'] = np.where(df_community_housing_info['community_housing_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_community_housing_info

    community_housing_info_id community_housing_category  value_type_id
0                           1              householdsize              2
1                           2            PctLargHouseFam              1
2                           3          PctLargHouseOccup              1
3                           4           PersPerOccupHous              2
4                           5          PersPerOwnOccHous              2
5                           6         PersPerRentOccHous              2
6                           7            PctPersOwnOccup              1
7                           8           PctPersDenseHous              1
8                           9             PctHousLess3BR              1
9                          10                   MedNumBR              2
10                         11                 HousVacant              2
11                         12               PctHousOccup              1
12                         13              PctHousOwnOcc              1
13                         14           PctVacantBoarded              1
14                         15             PctVacMore6Mos              1
15                         16             MedYrHousBuilt              2
16                         17             PctHousNoPhone              1
17                         18             PctWOFullPlumb              1

Insert into table in database

In [ ]:
df_community_housing_info.to_sql(name='community_housing_info', con=engine, if_exists='append', index=False)

18

#### Create df_community_community_housing_info

Slice necessary columns

In [ ]:
df_community_community_housing_info = df1[['community_id','householdsize', 'PctLargHouseFam', 'PctLargHouseOccup', 'PersPerOccupHous','PersPerOwnOccHous','PersPerRentOccHous','PctPersOwnOccup','PctPersDenseHous','PctHousLess3BR','MedNumBR','HousVacant','PctHousOccup','PctHousOwnOcc','PctVacantBoarded','PctVacMore6Mos','MedYrHousBuilt','PctHousNoPhone','PctWOFullPlumb']]

In [ ]:
df_community_community_housing_info.head()

,community_id,householdsize,PctLargHouseFam,PctLargHouseOccup,PersPerOccupHous,PersPerOwnOccHous,PersPerRentOccHous,PctPersOwnOccup,PctPersDenseHous,PctHousLess3BR,MedNumBR,HousVacant,PctHousOccup,PctHousOwnOcc,PctVacantBoarded,PctVacMore6Mos,MedYrHousBuilt,PctHousNoPhone,PctWOFullPlumb
0,1,3.10,4.81,4.17,2.99,3.00,2.84,91.46,0.39,11.06,3.0,64.0,98.37,91.01,3.12,37.50,1959.0,0.00,0.28
1,2,2.82,4.25,3.34,2.70,2.83,1.96,89.03,1.01,23.60,3.0,240.0,97.15,84.88,0.00,18.33,1958.0,0.31,0.14
2,3,2.43,2.97,2.05,2.42,2.69,2.06,64.18,2.03,47.46,3.0,544.0,95.68,57.79,0.92,7.54,1976.0,1.55,0.12
3,4,2.40,3.93,2.56,2.37,2.51,2.20,58.18,1.21,45.66,3.0,669.0,91.19,54.89,2.54,57.85,1939.0,7.00,0.87
4,5,2.76,5.23,3.11,2.35,2.55,2.12,58.13,2.94,55.64,2.0,333.0,92.45,53.57,3.90,42.64,1958.0,7.45,0.82

pd.melt() to pivot longer

In [ ]:
df_community_community_housing_info = pd.melt(df_community_community_housing_info, 
                                         id_vars = ['community_id'], 
                                         value_vars = community_housing_info_category)
df_community_community_housing_info.head()

   community_id       variable  value
0             1  householdsize   3.10
1             2  householdsize   2.82
2             3  householdsize   2.43
3             4  householdsize   2.40
4             5  householdsize   2.76

Rename columns

In [ ]:
df_community_community_housing_info = df_community_community_housing_info.rename(columns = {"variable": "community_housing_category",
                                             "value": "community_housing_info_value"})

In [ ]:
df_community_community_housing_info.head()

   community_id community_housing_category  community_housing_info_value
0             1              householdsize                          3.10
1             2              householdsize                          2.82
2             3              householdsize                          2.43
3             4              householdsize                          2.40
4             5              householdsize                          2.76

Join housing_migration_id by community_housing_info

In [ ]:
df_community_community_housing_info = df_community_community_housing_info.merge(df_community_housing_info[['community_housing_category','community_housing_info_id']], on='community_housing_category')
df_community_community_housing_info = df_community_community_housing_info.drop(columns = ['community_housing_category'])

In [ ]:
df_community_community_housing_info.head()

   community_id  community_housing_info_value  community_housing_info_id
0             1                          3.10                          1
1             2                          2.82                          1
2             3                          2.43                          1
3             4                          2.40                          1
4             5                          2.76                          1

Reorder the column

In [ ]:
df_community_community_housing_info = df_community_community_housing_info.iloc[:, [0,2,1]]

In [ ]:
df_community_community_housing_info.head()

   community_id  community_housing_info_id  community_housing_info_value
0             1                          1                          3.10
1             2                          1                          2.82
2             3                          1                          2.43
3             4                          1                          2.40
4             5                          1                          2.76

In [ ]:
df_community_community_housing_info.tail()

       community_id  community_housing_info_id  community_housing_info_value
39865          2211                         18                          0.55
39866          2212                         18                          0.12
39867          2213                         18                          0.27
39868          2214                         18                          0.87
39869          2215                         18                          1.43

Insert table into database

In [ ]:
df_community_community_housing_info.to_sql(name='community_community_housing_info', con=engine, if_exists='append', index=False)

870

#### Create df_poverty

In [ ]:
df_poverty = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
poverty_category = df1.iloc[0:5, 34:35].columns.tolist()
print(poverty_category)

['PctPopUnderPov']

In [ ]:
df_poverty['poverty_category'] = poverty_category

In [ ]:
df_poverty.head()

  poverty_category
0   PctPopUnderPov

Insert ID column

In [ ]:
df_poverty.insert(0, 'poverty_id', range(1, 1 + len(df_poverty)))

In [ ]:
df_poverty.head()

   poverty_id poverty_category
0           1   PctPopUnderPov

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_poverty['value_type_id'] = np.where(df_poverty['poverty_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_poverty.head()

   poverty_id poverty_category  value_type_id
0           1   PctPopUnderPov              1

Insert into community_poverty table in database

In [ ]:
df_poverty.to_sql(name='poverty', con=engine, if_exists='append', index=False)

1

#### Create df_community_poverty

Slice necessary columns

In [ ]:
df_community_poverty = df1.iloc[:, [0,34]]

pd.melt() to pivot longer

In [ ]:
df_community_poverty = pd.melt(df_community_poverty, id_vars = ['community_id'], value_vars=poverty_category)

In [ ]:
df_community_poverty.head()

   community_id        variable  value
0             1  PctPopUnderPov   1.96
1             2  PctPopUnderPov   3.98
2             3  PctPopUnderPov   4.75
3             4  PctPopUnderPov  17.23
4             5  PctPopUnderPov  29.99

Rename columns

In [ ]:
df_community_poverty = df_community_poverty.rename(columns = {"variable": "poverty_category",
                                             "value": "poverty_value"})

In [ ]:
df_community_poverty = df_community_poverty.merge(df_poverty[['poverty_category','poverty_id']], on='poverty_category')
df_community_poverty = df_community_poverty.drop(columns = ['poverty_category'])

In [ ]:
df_community_poverty.head()

   community_id  poverty_value  poverty_id
0             1           1.96           1
1             2           3.98           1
2             3           4.75           1
3             4          17.23           1
4             5          29.99           1

Reorder the column to be community_id, community_poverty_id, community_poverty_value

In [ ]:
df_community_poverty = df_community_poverty.iloc[:, [0,2,1]]

In [ ]:
df_community_poverty.tail()

      community_id  poverty_id  poverty_value
2210          2211           1          25.06
2211          2212           1          20.79
2212          2213           1           7.56
2213          2214           1          30.32
2214          2215           1          18.50

Insert into community_poverty table in database

In [ ]:
df_community_poverty.to_sql(name='community_poverty', con=engine, if_exists='append', index=False)

215

#### Create df_police_demographics

In [ ]:
df_police_demographics = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
police_demographics_category = df1.iloc[0:5, 112:118].columns.tolist()
print(demographics_category)

['RacialMatchCommPol', 'PctPolicWhite', 'PctPolicBlack', 'PctPolicHisp', 'PctPolicAsian', 'PctPolicMinor']

In [ ]:
df_police_demographics['police_demographics_category'] = police_demographics_category

In [ ]:
df_police_demographics.head()

  police_demographics_category
0           RacialMatchCommPol
1                PctPolicWhite
2                PctPolicBlack
3                 PctPolicHisp
4                PctPolicAsian

Insert ID column

In [ ]:
df_police_demographics.insert(0, 'police_demographics_id', range(1, 1 + len(df_police_demographics)))

In [ ]:
df_police_demographics.head()

   police_demographics_id police_demographics_category
0                       1           RacialMatchCommPol
1                       2                PctPolicWhite
2                       3                PctPolicBlack
3                       4                 PctPolicHisp
4                       5                PctPolicAsian

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_police_demographics['value_type_id'] = np.where(df_police_demographics['police_demographics_category'].str.contains('pct|Pct|RacialMatch'), 1, 2)

In [ ]:
df_police_demographics.head()

   police_demographics_id police_demographics_category  value_type_id
0                       1           RacialMatchCommPol              1
1                       2                PctPolicWhite              1
2                       3                PctPolicBlack              1
3                       4                 PctPolicHisp              1
4                       5                PctPolicAsian              1

Insert into police_demographics table in database

In [ ]:
df_police_demographics.to_sql(name='police_demographics', con=engine, if_exists='append', index=False)

6

#### Create df_community_police_demographics

Slice necessary columns

In [ ]:
df_community_police_demographics = df1.iloc[:, [0,112,113,114,115,116,117]]

pd.melt() to pivot longer

In [ ]:
df_community_police_demographics = pd.melt(df_community_police_demographics, id_vars = ['community_id'], value_vars=police_demographics_category)

In [ ]:
df_community_police_demographics.head()

   community_id            variable  value
0             1  RacialMatchCommPol   -1.0
1             2  RacialMatchCommPol   -1.0
2             3  RacialMatchCommPol   -1.0
3             4  RacialMatchCommPol   -1.0
4             5  RacialMatchCommPol   -1.0

Rename columns

In [ ]:
df_community_police_demographics = df_community_police_demographics.rename(columns = {"variable": "police_demographics_category",
                                             "value": "police_demographics_value"})

In [ ]:
df_community_police_demographics = df_community_police_demographics.merge(df_police_demographics[['police_demographics_category','police_demographics_id']], on='police_demographics_category')
df_community_police_demographics = df_community_police_demographics.drop(columns = ['police_demographics_category'])

In [ ]:
df_community_police_demographics.head()

   community_id  police_demographics_value  police_demographics_id
0             1                       -1.0                       1
1             2                       -1.0                       1
2             3                       -1.0                       1
3             4                       -1.0                       1
4             5                       -1.0                       1

Reorder the column to be community_id, community_police_demographics_id, community_police_demographics_value

In [ ]:
df_community_police_demographics = df_community_police_demographics.iloc[:, [0,2,1]]

In [ ]:
df_community_police_demographics.tail()

       community_id  police_demographics_id  police_demographics_value
13285          2211                       6                       -1.0
13286          2212                       6                       -1.0
13287          2213                       6                       -1.0
13288          2214                       6                       -1.0
13289          2215                       6                       -1.0

Insert into community_police_demographics table in database

In [ ]:
df_community_police_demographics.to_sql(name='community_police_demographics', con=engine, if_exists='append', index=False)

290

#### Create df_age

In [ ]:
df_age = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
age_category = df1.iloc[0:5, 12:16].columns.tolist()
print(age_category)

['agePct12t21', 'agePct12t29', 'agePct16t24', 'agePct65up']

In [ ]:
df_age['age_category'] = age_category

In [ ]:
df_age.head(9)

  age_category
0  agePct12t21
1  agePct12t29
2  agePct16t24
3   agePct65up

Insert ID column

In [ ]:
df_age.insert(0, 'age_id', range(1, 1 + len(df_age)))

In [ ]:
df_age.head()

   age_id age_category
0       1  agePct12t21
1       2  agePct12t29
2       3  agePct16t24
3       4   agePct65up

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_age['value_type_id'] = np.where(df_age['age_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_age.head(9)

   age_id age_category  value_type_id
0       1  agePct12t21              1
1       2  agePct12t29              1
2       3  agePct16t24              1
3       4   agePct65up              1

Insert into income table in database

In [ ]:
df_age.to_sql(name='age', con=engine, if_exists='append', index=False)

4

#### Create df_community_age

Slice necessary columns

In [ ]:
df_community_age = df1.iloc[:, [0,12,13,14,15]]

pd.melt() to pivot longer

In [ ]:
df_community_age = pd.melt(df_community_age, id_vars = ['community_id'], value_vars=age_category)

In [ ]:
df_community_age.head()

   community_id     variable  value
0             1  agePct12t21  12.47
1             2  agePct12t21  11.01
2             3  agePct12t21  11.36
3             4  agePct12t21  12.55
4             5  agePct12t21  24.46

Rename columns

In [ ]:
df_community_age = df_community_age.rename(columns = {"variable": "age_category",
                                             "value": "age_value"})

In [ ]:
df_community_age.head()

   community_id age_category  age_value
0             1  agePct12t21      12.47
1             2  agePct12t21      11.01
2             3  agePct12t21      11.36
3             4  agePct12t21      12.55
4             5  agePct12t21      24.46

Join age_id by age_category

In [ ]:
df_community_age = df_community_age.merge(df_age[['age_category','age_id']], on='age_category')
df_community_age = df_community_age.drop(columns = ['age_category'])

In [ ]:
df_community_age.head()

   community_id  age_value  age_id
0             1      12.47       1
1             2      11.01       1
2             3      11.36       1
3             4      12.55       1
4             5      24.46       1

Reorder the column to be community_id, age_id, age_value

In [ ]:
df_community_age = df_community_age.iloc[:, [0,2,1]]

In [ ]:
df_community_age.tail()

      community_id  age_id  age_value
8855          2211       4       8.08
8856          2212       4      12.57
8857          2213       4      20.73
8858          2214       4      10.42
8859          2215       4      12.12

Insert into community_age table in database

In [ ]:
df_community_age.to_sql(name='community_age', con=engine, if_exists='append', index=False)

860

#### Create df_family

In [ ]:
df_family = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
columns_family = [44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 56]
family_category = df1.iloc[0:5, columns_family].columns.tolist()
print(family_category)

['MalePctDivorce', 'MalePctNevMarr', 'FemalePctDiv', 'TotalPctDiv', 'PersPerFam', 'PctFam2Par', 'PctKids2Par', 'PctYoungKids2Par', 'PctTeen2Par', 'PctWorkMomYoungKids', 'PctWorkMom', 'PctKidsBornNeverMar']

In [ ]:
df_family['family_category'] = family_category

In [ ]:
df_family.head(10)

       family_category
0       MalePctDivorce
1       MalePctNevMarr
2         FemalePctDiv
3          TotalPctDiv
4           PersPerFam
5           PctFam2Par
6          PctKids2Par
7     PctYoungKids2Par
8          PctTeen2Par
9  PctWorkMomYoungKids

Insert ID column

In [ ]:
df_family.insert(0, 'family_id', range(1, 1 + len(df_family)))

In [ ]:
df_family.head()

   family_id family_category
0          1  MalePctDivorce
1          2  MalePctNevMarr
2          3    FemalePctDiv
3          4     TotalPctDiv
4          5      PersPerFam

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_family['value_type_id'] = np.where(df_family['family_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_family.head(10)

   family_id      family_category  value_type_id
0          1       MalePctDivorce              1
1          2       MalePctNevMarr              1
2          3         FemalePctDiv              1
3          4          TotalPctDiv              1
4          5           PersPerFam              2
5          6           PctFam2Par              1
6          7          PctKids2Par              1
7          8     PctYoungKids2Par              1
8          9          PctTeen2Par              1
9         10  PctWorkMomYoungKids              1

Insert into family table in database

In [ ]:
df_family.to_sql(name='family', con=engine, if_exists='append', index=False)

12

#### Create df_community_family

Slice necessary columns

In [ ]:
df_community_family = df1.iloc[:, [0, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 56]]

pd.melt() to pivot longer

In [ ]:
df_community_family = pd.melt(df_community_family, id_vars = ['community_id'], value_vars=family_category)

In [ ]:
df_community_family.head()

   community_id        variable  value
0             1  MalePctDivorce   3.67
1             2  MalePctDivorce   4.23
2             3  MalePctDivorce  10.10
3             4  MalePctDivorce  10.98
4             5  MalePctDivorce   7.51

Rename columns

In [ ]:
df_community_family = df_community_family.rename(columns = {"variable": "family_category",
                                             "value": "family_value"})

In [ ]:
df_community_family.head()

   community_id family_category  family_value
0             1  MalePctDivorce          3.67
1             2  MalePctDivorce          4.23
2             3  MalePctDivorce         10.10
3             4  MalePctDivorce         10.98
4             5  MalePctDivorce          7.51

Join family_id by family_category

In [ ]:
df_community_family = df_community_family.merge(df_family[['family_category','family_id']], on='family_category')
df_community_family = df_community_family.drop(columns = ['family_category'])

In [ ]:
df_community_family.head()

   community_id  family_value  family_id
0             1          3.67          1
1             2          4.23          1
2             3         10.10          1
3             4         10.98          1
4             5          7.51          1

Reorder the column to be community_id, family_id, family_value

In [ ]:
df_community_family = df_community_family.iloc[:, [0,2,1]]

In [ ]:
df_community_family.tail()

       community_id  family_id  family_value
26575          2211         12          4.49
26576          2212         12          2.98
26577          2213         12          1.60
26578          2214         12          2.35
26579          2215         12          4.85

Insert into community_family table in database

In [ ]:
df_community_family.to_sql(name='community_family', con=engine, if_exists='append', index=False)

580

#### Create df_police_requests

In [ ]:
df_police_requests = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
police_requests_category = df1.iloc[:,108:111].columns.tolist()
print(police_requests_category)

['LemasTotalReq', 'LemasTotReqPerPop', 'PolicReqPerOffic']

In [ ]:
df_police_requests['police_requests_category'] = police_requests_category

In [ ]:
df_police_requests.head()

  police_requests_category
0            LemasTotalReq
1        LemasTotReqPerPop
2         PolicReqPerOffic

Insert ID column

In [ ]:
df_police_requests.insert(0,'police_requests_id',range(1,len(df_police_requests)+1))

In [ ]:
df_police_requests.head()

   police_requests_id police_requests_category
0                   1            LemasTotalReq
1                   2        LemasTotReqPerPop
2                   3         PolicReqPerOffic

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_police_requests['value_type_id'] = np.where(df_police_requests['police_requests_category'].str.contains('pct|Pct'),1,2)

In [ ]:
df_police_requests.head()

   police_requests_id police_requests_category  value_type_id
0                   1            LemasTotalReq              2
1                   2        LemasTotReqPerPop              2
2                   3         PolicReqPerOffic              2

Insert into police_requests table in database

In [ ]:
df_police_requests.to_sql(name = 'police_requests', con = engine, if_exists = 'append', index = False)

3

#### Create df_community_police_requests

Slice necessary columns

In [ ]:
df_community_police_requests = df1.iloc[:,[*range(0,1), *range(108,111)]]

pd.melt() to pivot longer

In [ ]:
df_community_police_requests = pd.melt(df_community_police_requests, id_vars = 'community_id', value_vars = police_requests_category, var_name='police_requests_category', value_name='police_requests_value')

In [ ]:
df_community_police_requests.head()

   community_id police_requests_category  police_requests_value
0             1            LemasTotalReq                   -1.0
1             2            LemasTotalReq                   -1.0
2             3            LemasTotalReq                   -1.0
3             4            LemasTotalReq                   -1.0
4             5            LemasTotalReq                   -1.0

In [ ]:
df_community_police_requests = df_community_police_requests.merge(df_police_requests[['police_requests_id','police_requests_category']], on = 'police_requests_category')
df_community_police_requests = df_community_police_requests.drop(columns = ['police_requests_category'])

In [ ]:
df_community_police_requests.iloc[7:15,:]

    community_id  police_requests_value  police_requests_id
7              8                   -1.0                   1
8              9                   -1.0                   1
9             10                73432.0                   1
10            11                   -1.0                   1
11            12                   -1.0                   1
12            13                   -1.0                   1
13            14                39900.0                   1
14            15                   -1.0                   1

Reorder the column to be community_id, police_requests_id, police_requests_value

In [ ]:
df_community_police_requests = df_community_police_requests.iloc[:, [0,2,1]]

In [ ]:
df_community_police_requests.tail()

      community_id  police_requests_id  police_requests_value
6640          2211                   3                   -1.0
6641          2212                   3                   -1.0
6642          2213                   3                   -1.0
6643          2214                   3                   -1.0
6644          2215                   3                   -1.0

Insert into community_police_requests table in database

In [ ]:
df_community_police_requests.to_sql(name = 'community_police_requests', con = engine, if_exists = 'append', index = False)

645

#### Create df_employment

In [ ]:
df_employment = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
employment_category = df1.iloc[:,38:44].columns.tolist()
print(employment_category)

['PctUnemployed', 'PctEmploy', 'PctEmplManu', 'PctEmplProfServ', 'PctOccupManu', 'PctOccupMgmtProf']

In [ ]:
df_employment['employment_category'] = employment_category

In [ ]:
df_employment.head()

  employment_category
0       PctUnemployed
1           PctEmploy
2         PctEmplManu
3     PctEmplProfServ
4        PctOccupManu

Insert ID column

In [ ]:
df_employment.insert(0,'employment_id', range(1, len(df_employment)+1))

In [ ]:
df_employment.head()

   employment_id employment_category
0              1       PctUnemployed
1              2           PctEmploy
2              3         PctEmplManu
3              4     PctEmplProfServ
4              5        PctOccupManu

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_employment['value_type_id'] = np.where(df_employment['employment_category'].str.contains('pct|Pct'),1,2)

In [ ]:
df_employment.head()

   employment_id employment_category  value_type_id
0              1       PctUnemployed              1
1              2           PctEmploy              1
2              3         PctEmplManu              1
3              4     PctEmplProfServ              1
4              5        PctOccupManu              1

Insert into employment table in database

In [ ]:
df_employment.to_sql(name = 'employment', con = engine, if_exists = 'append', index = False)

6

#### Create df_community_employment

Slice necessary columns

In [ ]:
df_community_employment = df1.iloc[:, [*range(0,1), *range(38,44)]]

pd.melt() to pivot longer

In [ ]:
df_community_employment = pd.melt(df_community_employment, id_vars = 'community_id', value_vars = employment_category, var_name = 'employment_category', value_name = 'employment_value')

In [ ]:
df_community_employment.head()

   community_id employment_category  employment_value
0             1       PctUnemployed              2.70
1             2       PctUnemployed              2.43
2             3       PctUnemployed              4.01
3             4       PctUnemployed              9.86
4             5       PctUnemployed              9.08

Join employment_id by employment_category

In [ ]:
df_community_employment = df_community_employment.merge(df_employment[['employment_id','employment_category']], on = 'employment_category')
df_community_employment = df_community_employment.drop(columns = 'employment_category')

In [ ]:
df_community_employment.head()

   community_id  employment_value  employment_id
0             1              2.70              1
1             2              2.43              1
2             3              4.01              1
3             4              9.86              1
4             5              9.08              1

Reorder the column to be community_id, employment_id, employment_value

In [ ]:
df_community_employment = df_community_employment.iloc[:, [0,2,1]]

In [ ]:
df_community_employment.tail()

       community_id  employment_id  employment_value
13285          2211              6             25.02
13286          2212              6             28.73
13287          2213              6             23.54
13288          2214              6             20.87
13289          2215              6             17.44

Insert into community_employment table in database

In [ ]:
df_community_employment.to_sql(name = 'community_employment', con = engine, if_exists = 'append', index = False)

290

#### Create df_housing

In [ ]:
df_housing = pd.DataFrame()

Slice necessary columns and convert to list as string for category column

In [ ]:
housing_category = df1.iloc[:,85:97].columns.tolist()
print(housing_category)

['OwnOccLowQuart', 'OwnOccMedVal', 'OwnOccHiQuart', 'OwnOccQrange', 'RentLowQ', 'RentMedian', 'RentHighQ', 'RentQrange', 'MedRent', 'MedRentPctHousInc', 'MedOwnCostPctInc', 'MedOwnCostPctIncNoMtg']

In [ ]:
df_housing['housing_category'] = housing_category

In [ ]:
df_housing

         housing_category
0          OwnOccLowQuart
1            OwnOccMedVal
2           OwnOccHiQuart
3            OwnOccQrange
4                RentLowQ
5              RentMedian
6               RentHighQ
7              RentQrange
8                 MedRent
9       MedRentPctHousInc
10       MedOwnCostPctInc
11  MedOwnCostPctIncNoMtg

Insert ID column

In [ ]:
df_housing.insert(0,'housing_id',range(1, len(df_housing)+1))

In [ ]:
df_housing.head()

   housing_id housing_category
0           1   OwnOccLowQuart
1           2     OwnOccMedVal
2           3    OwnOccHiQuart
3           4     OwnOccQrange
4           5         RentLowQ

Create a value_type_id. If category contains pct then value_type_id == 1, else 2 for integer

In [ ]:
df_housing['value_type_id'] = np.where(df_housing['housing_category'].str.contains('pct|Pct'), 1, 2)

In [ ]:
df_housing

    housing_id       housing_category  value_type_id
0            1         OwnOccLowQuart              2
1            2           OwnOccMedVal              2
2            3          OwnOccHiQuart              2
3            4           OwnOccQrange              2
4            5               RentLowQ              2
5            6             RentMedian              2
6            7              RentHighQ              2
7            8             RentQrange              2
8            9                MedRent              2
9           10      MedRentPctHousInc              1
10          11       MedOwnCostPctInc              1
11          12  MedOwnCostPctIncNoMtg              1

Insert into housing table in database

In [ ]:
df_housing.to_sql(name = 'housing', con = engine, if_exists = 'append', index = False)

12

#### Create df_community_housing

Slice necessary columns

In [ ]:
df_community_housing = df1.iloc[:,[*range(0,1),*range(85,97)]]

pd.melt() to pivot longer

In [ ]:
df_community_housing = pd.melt(df_community_housing, id_vars = 'community_id', value_vars = housing_category, var_name = 'housing_category', value_name = 'housing_value')

In [ ]:
df_community_housing.head()

   community_id housing_category  housing_value
0             1   OwnOccLowQuart       215900.0
1             2   OwnOccLowQuart       136300.0
2             3   OwnOccLowQuart        74700.0
3             4   OwnOccLowQuart        36400.0
4             5   OwnOccLowQuart        30600.0

Join housing_id by housing_category

In [ ]:
df_community_housing = df_community_housing.merge(df_housing[['housing_id','housing_category']], on = 'housing_category')
df_community_housing = df_community_housing.drop(columns = 'housing_category')

In [ ]:
df_community_housing.head()

   community_id  housing_value  housing_id
0             1       215900.0           1
1             2       136300.0           1
2             3        74700.0           1
3             4        36400.0           1
4             5        30600.0           1

Reorder the column to be community_id, housing_id, housing_value

In [ ]:
df_community_housing = df_community_housing.iloc[:, [0,2,1]]

In [ ]:
df_community_housing.tail()

       community_id  housing_id  housing_value
26575          2211          12           11.7
26576          2212          12           14.4
26577          2213          12           13.1
26578          2214          12           14.1
26579          2215          12           11.6

Insert into community_housing table in database

In [ ]:
df_community_housing.to_sql(name = 'community_housing', con = engine, if_exists = 'append', index = False)

580

## Close Connection & Engine

In [ ]:
#Close connection and engine to avoid resource leaks.

# Close the connection
connection.close()

# Close the engine
engine.dispose()